<?php

/**
 *  代码表 根据代码，对应相应的消息
 */
class ErrorMessage
{
    const SUCCESS_CODE = 200;

    private static $errors = array(
        /**
         * 基础错误码
         */
        - 1 => '系统错误',
        - 2 => '参数有误',
        - 3 => '数据库错误',
        - 4 => '数据有误',
        - 5 => '请重新登陆',
        - 6 => '请重新进入站点',
        - 7 => '不能重复提交',
        - 8 => '保存数据失败',
        - 9 => '这不是您的网站,请重新进入',
        - 10 => '口令错误',
        - 11 => '不能重复提交',

        // 验证用户名格式
        - 15010 => '用户名不能为空',
        - 15011 => '用户名长度在6-16个字符之间',
        - 15012 => '只能以英文字母或下划线开头',
        - 15013 => '只能包含英文字母，下划线或数字',

        // 验证密码格式
        - 15020 => '密码不能为空',
        - 15021 => '密码长度在6-16位之间',
        - 15023 => '密码必须含有大写字母,小写字母或数字中的两项',
        - 15026 => '密码不能有三位连续数字',
        - 15027 => '密码不能包含特殊字符',
        - 15029 => '两次输入的密码不一致',

        //注册用户
        - 15030 => '用户名已存在',
        - 15031 => '注册用户失败',

    );


    /**
     * 根据代码，返回失败数据
     */
    public static function getError($code = -1)
    {
        return isset(self::$errors[$code]) ? self::$errors[$code] : false;
    }
}
